Autodesk.Revit.UI.TaskDialogCommandLinkId
Enum to specify the Id of CommandLink.
Since: 2011

Autodesk.Revit.UI.TaskDialogCommandLinkId.CommandLink4
CommandLink4.

Autodesk.Revit.UI.TaskDialogCommandLinkId.CommandLink3
CommandLink3.

Autodesk.Revit.UI.TaskDialogCommandLinkId.CommandLink2
CommandLink2.

Autodesk.Revit.UI.TaskDialogCommandLinkId.CommandLink1
CommandLink1.